# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형 --> list, dictionary  tuple은 변경 불가
#  집합의 특징
#  1. ( mutable, 변경 가능 )
#  2. ( iterable, 반복 가능 )
#  3. ( sequence X, 인덱싱과 슬라이싱 불가 )
#  4. ( 중복 허용 안함 )
# ===========================================================

# 집합 생성
a = {}  # 딕셔너리
a = set()
print(type(a))

print({3, 3, 3, 2, 2, 1})
print(
    {100, 8, 24567, 12345, 23453678, 1, 456576, 3484}
)  # 8로 나눈 나머지가 작은거부터 큰거 순서로 출력
# ===========================================================
# 1. 집합은 mutable하다. (변경 가능)
# ===========================================================

a = {1, 2, 3}
a.update({3, 4})
print(a)

a.update({5, 6})  # 원본 변경
print(a)

a.remove(3)  # 원본 변경
print(a)

# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
for i in a:
    print(i)

# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================

# a[0] = 10    #__setitem__

# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10, 10, 20, 20, 20}
print(s)

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s))
print(sum(s))
print(min(s))
print(max(s))
print(sorted(s))


# 집합 합치기 set, dictionary 더하기 불가능
s2 = {40, 50}
# print(s + s2)
s.update(s2)
print(s)
print(s.union(s2))  # update와 동일, union은 새로운 집합 반환

# 집합 반복하기
# print(s * 2)

# 멤버십 연산자
print(10 in s)
print(1 in s)
